[
{
  "model": "data_management.termsandconditions",
  "pk": 1,
  "fields": {
    "version": "1",
    "content": "Service Booking Terms & Conditions\nOnline Service Booking Terms\nTERMS OF BOOKING\nIntroduction\nThis business and your authorised dealer, (“Dealer”) (collectively, “We” “Our” or “Us”) offer you the option to book and pay for a service on your Vehicle (including both scheduled and non-scheduled services) online (“Booking”). Our online service booking system lets you book and pay for a service for your Vehicle with your nominated Dealer in your own space and time (“Booking System”). Placing and paying for a Booking via the Booking System is only available to Australian residents aged 18 years and over. By using the Booking System, you agree to the following terms. Before finalising your Booking via the Booking System, you must carefully read and ACCEPT these Terms and the This business Privacy Policy.\nBy clicking ‘CONFIRM’ and submitting payment of the Fees for your Booking, you become bound by these Terms. If you do not wish to be bound by these Terms, do not click ‘CONFIRM’ and submit payment of the Fees.\nCertain laws such as the Competition and Consumer Act 2010 (Cth) and any applicable state-based consumer legislation (“Consumer Laws”) are in place for your protection. They are designed to ensure Our services are provided with due care and skill and are fit for purpose. The Terms do not alter any protection given to you under Consumer Laws.\nThese Terms form part of the agreement between you and the Dealer for provision of a Booking.\nDefinitions\nIn these Terms:\nAdditional Items means optional add-ons, services or accessory fitments in addition to your vehicle’s scheduled or non-scheduled service.\nAgreement means these Terms and any document expressly referred to in them.\nBooking means an online booking made by You for your Vehicle, which may include for a scheduled or non-scheduled service, accessories and/or other Additional Items, through the Booking System available via mobile applications or websites offered by the Dealer and/or This business.\nCustomer means a customer of this business.\nFees means the total price payable, including GST, for the confirmed Booking as displayed online (on the Booking System) or confirmed at the Dealer.\nPayment Card means any valid credit card or debit card provided by you.\nPersonal Information has the same meaning as in the Privacy Act 1988 (Cth).\nTerms means these booking and payment terms and conditions.\nVehicle means the vehicle you have made a Booking for.\nBooking process\nYou will be guided through a step-by-step process on the Booking System that enables you to (but not limited to):\nselect items for Booking, including any optional Additional Items;\nconfirm the Booking; and\npay the Fees online\nIf the Booking consists of a Price on Application (“POA”) item, the Fees may not be eligible for online payment but the Booking itself may still be confirmed.\nSelecting your Vehicle’s service\nPricing of the items are displayed on this business's website and as part of the Booking System.\nConfirming Your Booking\nOnce your Booking is confirmed, you will receive an email from your preferred Dealer detailing next steps.\nManagement of your Booking is handled by your preferred Dealer. You acknowledge that any changes to your Booking, including but not limited to rescheduling and/or cancellation, must be made between you and the Dealer. This business is not responsible for any agreements made between you and the Dealer in relation to the management of your Booking after your Booking has been confirmed.\nPayment Requirements\nIf you select to pay the Fees online when placing your Booking directly via the Booking System, We use a secure and encrypted online payment gateway. Payment methods may be subject to change.\nIf your payment is rejected, you will be invited to RETRY. If your payment is not accepted for any reason, your transaction will be cancelled by Us and you can contact the Dealer.\nWe reserve the right to amend any pricing errors displayed due to human error, computer malfunction or any other reason.\nIf your Vehicle requires unexpected work that falls outside the scope of the items included in the Booking, the Dealer will contact you to discuss. Additional items or work required on your Vehicle may have an extra cost. Any extra costs agreed between you and the Dealer are to be paid by you to the Dealer prior to collection of your Vehicle or as otherwise agreed with the Dealer.\nFulfilling your Booking\nOnce you deliver your Vehicle to your selected Dealer and the Booking is completed by the Dealer, your Dealer will communicate with You to confirm collection of your Vehicle, payment of the Fees and/or any additional amounts (if required), or any further arrangements.\nRescheduling or Cancelling your Booking\nRescheduling your Booking\nIn the event your Booking needs to be rescheduled by the Dealer for any reason, the Dealer will communicate with you in writing (including by email) or by phone as soon as reasonably practicable prior to the Booking date.\nIn the event you need to reschedule your Booking, you must contact the Dealer directly. This business is not responsible for any agreements made between you and the Dealer.\nCancellation by You\nYou may cancel your Booking at any time by notifying the Dealer in writing (including by email) or by phone prior to the Booking date.\nIf the Booking is cancelled by you in the prescribed time and manner, any payments made by you via the Booking System for the Booking (including the Fees) will be refunded in full and processed through our online refund system.\nCancellation by Us\nThe Dealer may cancel your Booking by notifying you either in writing (including by email) or by phone prior to the Booking date.\nIf the Booking is cancelled by the Dealer, any payments made by you via the Booking System for the Booking (including the Fees) will be refunded in full and processed through our online refund system.\nPrivacy\nThe Personal Information collected in connection with your Booking is collected by This business. The Personal Information collected by This business will be handled in accordance with This business's Privacy Policy. The terms of This business's Privacy Policy, as updated from time to time are incorporated into these Terms by reference.\nIntellectual property\nAll information contained in this website is protected by copyright and all of the intellectual property rights in and to the Booking System belongs to This business and This business's licensors.\nYou are not permitted to copy, distribute, modify, create derivative works, download, store, transmit or reproduce any of the material, including but not limited to images, text or other content, from this website or the Booking System without This business's prior written consent, except as follows:\nyou may print or download pages of the website for your own personal, non-commercial use and not for further reproduction, publication, or distribution;\nyour computer may temporarily store copies of such materials in RAM incidental to your accessing and viewing those materials; and\nyou may store files that are automatically cached by your web browser for display enhancement purposes.\nLiability\nAll warranties and conditions are expressly excluded from these Terms to the maximum extent permitted by law. Any liability that This business cannot by law exclude in respect of goods and services is limited, where permitted by law, to supplying, or paying the cost of supplying, the goods and services again or repairing, or paying the costs of repairing, the goods, at This business's option.\nThis business, the Dealer, and their officers, employees, contractors and agents will not be liable to you, your authorised representative or anyone else for any direct, indirect, incidental or consequential loss of any nature caused by, or any claim which is not attributable (directly or indirectly) to the performance, the failure to perform or the delay in performance of the obligations of This business under these Terms. In all other circumstances, liability will be limited to the maximum amount allowable by law.\nGeneral\nThis Agreement is governed by and must be construed in accordance with the laws in the State of Western Australia, Australia. You and This business submit to the exclusive jurisdiction of the courts of Western Australia, and courts competent to determine appeals from those courts, with respect to any proceedings that may be brought at any time relating to this Agreement and these Terms. Neither This business nor you will object to the exercise of jurisdiction of those courts on any basis.\nThis business may engage third parties to supply services for it in connection with the Booking System. However, the engagement of third parties under this clause will not affect This business's rights and obligations under these Terms.\nFailure by either you or This business to enforce a particular term or condition does not constitute a waiver of that term or condition.\nIn the event of any inconsistency between these Terms and terms and conditions contained in any other material relating to the Booking System, these Terms will prevail to the extent of any inconsistency.\nThis business may assign or transfer its rights and obligations under these Terms to another organisation, but this will not affect your rights or This business's obligations under this Agreement or these Terms.\nContacting Us\nIf you have a question, problem or complaint or need to contact us for any other reason, please contact the Dealer.\n`After-Hours Vehicle Drop-Off & Limitation of Liability\na. General: The after-hours drop-off service (the \"Service\") is provided as a convenience to the Customer. Use of the Service constitutes the Customer's express agreement to the terms outlined in this clause.\nb. No Assumption of Liability: Allbikes and Vespa Warehouse assumes no custody, care, control, or liability whatsoever for any vehicle left by a Customer on or near its premises outside of stated business hours.\nc. Commencement of Bailment: The legal bailment, and therefore Allbikes and Vespa Warehouse's assumption of responsibility for the Customer's vehicle, shall commence only at the point in time when Allbikes and Vespa Warehouse personnel have (i) retrieved the keys from the key drop location, and (ii) physically moved the vehicle into our secure workshop during regular business hours.\nd. Release of Claims: The Customer hereby releases and holds harmless Allbikes and Vespa Warehouse, its employees, and agents from any and all claims, damages, and losses arising from theft, vandalism, fire, weather-related damage, or any other cause of loss to their motorcycle prior to the formal commencement of bailment as defined in c.\n\n",
    "published_at": "2026-01-05T13:34:11.672Z"
  }
},
{
  "model": "data_management.termsandconditions",
  "pk": 2,
  "fields": {
    "version": "2",
    "content": "<!DOCTYPE html>\n<html lang=\"en\">\n<head>\n    <meta charset=\"UTF-8\">\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\n    <title>Service Booking Terms & Conditions</title>\n</head>\n<body>\n    <h1>Service Booking Terms & Conditions</h1>\n\n    <h2>Online Service Booking Terms</h2>\n    <h2>TERMS OF BOOKING</h2>\n\n    <h3>Introduction</h3>\n    <p>This business and your authorised dealer, (“Dealer”) (collectively, “We” “Our” or “Us”) offer you the option to book and pay for a service on your Vehicle (including both scheduled and non-scheduled services) online (“Booking”). Our online service booking system lets you book and pay for a service for your Vehicle with your nominated Dealer in your own space and time (“Booking System”). Placing and paying for a Booking via the Booking System is only available to Australian residents aged 18 years and over. By using the Booking System, you agree to the following terms. Before finalising your Booking via the Booking System, you must carefully read and <strong>ACCEPT</strong> these Terms and the This business Privacy Policy.</p>\n    <p>By clicking ‘CONFIRM’ and submitting payment of the Fees for your Booking, you become bound by these Terms. If you do not wish to be bound by these Terms, do not click ‘CONFIRM’ and submit payment of the Fees.</p>\n    <p>Certain laws such as the Competition and Consumer Act 2010 (Cth) and any applicable state-based consumer legislation (“Consumer Laws”) are in place for your protection. They are designed to ensure Our services are provided with due care and skill and are fit for purpose. The Terms do not alter any protection given to you under Consumer Laws.</p>\n    <p>These Terms form part of the agreement between you and the Dealer for provision of a Booking.</p>\n\n    <h3>Definitions</h3>\n    <p>In these Terms:</p>\n    <p><strong>Additional Items</strong> means optional add-ons, services or accessory fitments in addition to your vehicle’s scheduled or non-scheduled service.</p>\n    <p><strong>Agreement</strong> means these Terms and any document expressly referred to in them.</p>\n    <p><strong>Booking</strong> means an online booking made by You for your Vehicle, which may include for a scheduled or non-scheduled service, accessories and/or other Additional Items, through the Booking System available via mobile applications or websites offered by the Dealer and/or This business.</p>\n    <p><strong>Customer</strong> means a customer of this business.</p>\n    <p><strong>Fees</strong> means the total price payable, including GST, for the confirmed Booking as displayed online (on the Booking System) or confirmed at the Dealer.</p>\n    <p><strong>Payment Card</strong> means any valid credit card or debit card provided by you.</p>\n    <p><strong>Personal Information</strong> has the same meaning as in the Privacy Act 1988 (Cth).</p>\n    <p><strong>Terms</strong> means these booking and payment terms and conditions.</p>\n    <p><strong>Vehicle</strong> means the vehicle you have made a Booking for.</p>\n\n    <h3>Booking process</h3>\n    <p>You will be guided through a step-by-step process on the Booking System that enables you to (but not limited to):</p>\n    <ul>\n        <li>select items for Booking, including any optional Additional Items;</li>\n        <li>confirm the Booking; and</li>\n        <li>pay the Fees online</li>\n    </ul>\n    <p>If the Booking consists of a Price on Application (“POA”) item, the Fees may not be eligible for online payment but the Booking itself may still be confirmed.</p>\n\n    <h3>Selecting your Vehicle’s service</h3>\n    <p>Pricing of the items are displayed on this business's website and as part of the Booking System.</p>\n\n    <h3>Confirming Your Booking</h3>\n    <p>Once your Booking is confirmed, you will receive an email from your preferred Dealer detailing next steps.</p>\n    <p>Management of your Booking is handled by your preferred Dealer. You acknowledge that any changes to your Booking, including but not limited to rescheduling and/or cancellation, must be made between you and the Dealer. This business is not responsible for any agreements made between you and the Dealer in relation to the management of your Booking after your Booking has been confirmed.</p>\n\n    <h3>Payment Requirements</h3>\n    <p>If you select to pay the Fees online when placing your Booking directly via the Booking System, We use a secure and encrypted online payment gateway. Payment methods may be subject to change.</p>\n    <p>If your payment is rejected, you will be invited to RETRY. If your payment is not accepted for any reason, your transaction will be cancelled by Us and you can contact the Dealer.</p>\n    <p>We reserve the right to amend any pricing errors displayed due to human error, computer malfunction or any other reason.</p>\n    <p>If your Vehicle requires unexpected work that falls outside the scope of the items included in the Booking, the Dealer will contact you to discuss. Additional items or work required on your Vehicle may have an extra cost. Any extra costs agreed between you and the Dealer are to be paid by you to the Dealer prior to collection of your Vehicle or as otherwise agreed with the Dealer.</p>\n\n    <h3>Fulfilling your Booking</h3>\n    <p>Once you deliver your Vehicle to your selected Dealer and the Booking is completed by the Dealer, your Dealer will communicate with You to confirm collection of your Vehicle, payment of the Fees and/or any additional amounts (if required), or any further arrangements.</p>\n\n    <h3>Rescheduling or Cancelling your Booking</h3>\n    <h4>Rescheduling your Booking</h4>\n    <p>In the event your Booking needs to be rescheduled by the Dealer for any reason, the Dealer will communicate with you in writing (including by email) or by phone as soon as reasonably practicable prior to the Booking date.</p>\n    <p>In the event you need to reschedule your Booking, you must contact the Dealer directly. This business is not responsible for any agreements made between you and the Dealer.</p>\n\n    <h4>Cancellation by You</h4>\n    <p>You may cancel your Booking at any time by notifying the Dealer in writing (including by email) or by phone prior to the Booking date.</p>\n    <p>If the Booking is cancelled by you in the prescribed time and manner, any payments made by you via the Booking System for the Booking (including the Fees) will be refunded in full and processed through our online refund system.</p>\n\n    <h4>Cancellation by Us</h4>\n    <p>The Dealer may cancel your Booking by notifying you either in writing (including by email) or by phone prior to the Booking date.</p>\n    <p>If the Booking is cancelled by the Dealer, any payments made by you via the Booking System for the Booking (including the Fees) will be refunded in full and processed through our online refund system.</p>\n\n    <h3>Privacy</h3>\n    <p>The Personal Information collected in connection with your Booking is collected by This business. The Personal Information collected by This business will be handled in accordance with This business's Privacy Policy. The terms of This business's Privacy Policy, as updated from time to time are incorporated into these Terms by reference.</p>\n\n    <h3>Intellectual property</h3>\n    <p>All information contained in this website is protected by copyright and all of the intellectual property rights in and to the Booking System belongs to This business and This business's licensors.</p>\n    <p>You are not permitted to copy, distribute, modify, create derivative works, download, store, transmit or reproduce any of the material, including but not limited to images, text or other content, from this website or the Booking System without This business's prior written consent, except as follows:</p>\n    <ul>\n        <li>you may print or download pages of the website for your own personal, non-commercial use and not for further reproduction, publication, or distribution;</li>\n        <li>your computer may temporarily store copies of such materials in RAM incidental to your accessing and viewing those materials; and</li>\n        <li>you may store files that are automatically cached by your web browser for display enhancement purposes.</li>\n    </ul>\n\n    <h3>Liability</h3>\n    <p>All warranties and conditions are expressly excluded from these Terms to the maximum extent permitted by law. Any liability that This business cannot by law exclude in respect of goods and services is limited, where permitted by law, to supplying, or paying the cost of supplying, the goods and services again or repairing, or paying the costs of repairing, the goods, at This business's option.</p>\n    <p>This business, the Dealer, and their officers, employees, contractors and agents will not be liable to you, your authorised representative or anyone else for any direct, indirect, incidental or consequential loss of any nature caused by, or any claim which is not attributable (directly or indirectly) to the performance, the failure to perform or the delay in performance of the obligations of This business under these Terms. In all other circumstances, liability will be limited to the maximum amount allowable by law.</p>\n\n    <h3>General</h3>\n    <p>This Agreement is governed by and must be construed in accordance with the laws in the State of Western Australia, Australia. You and This business submit to the exclusive jurisdiction of the courts of Western Australia, and courts competent to determine appeals from those courts, with respect to any proceedings that may be brought at any time relating to this Agreement and these Terms. Neither This business nor you will object to the exercise of jurisdiction of those courts on any basis.</p>\n    <p>This business may engage third parties to supply services for it in connection with the Booking System. However, the engagement of third parties under this clause will not affect This business's rights and obligations under these Terms.</p>\n    <p>Failure by either you or This business to enforce a particular term or condition does not constitute a waiver of that term or condition.</p>\n    <p>In the event of any inconsistency between these Terms and terms and conditions contained in any other material relating to the Booking System, these Terms will prevail to the extent of any inconsistency.</p>\n    <p>This business may assign or transfer its rights and obligations under these Terms to another organisation, but this will not affect your rights or This business's obligations under this Agreement or these Terms.</p>\n\n    <h3>Contacting Us</h3>\n    <p>If you have a question, problem or complaint or need to contact us for any other reason, please contact the Dealer.</p>\n\n    <h3>After-Hours Vehicle Drop-Off & Limitation of Liability</h3>\n    <p>a. General: The after-hours drop-off service (the \"Service\") is provided as a convenience to the Customer. Use of the Service constitutes the Customer's express agreement to the terms outlined in this clause.</p>\n    <p>b. No Assumption of Liability: Allbikes and Vespa Warehouse assumes no custody, care, control, or liability whatsoever for any vehicle left by a Customer on or near its premises outside of stated business hours.</p>\n    <p>c. Commencement of Bailment: The legal bailment, and therefore Allbikes and Vespa Warehouse's assumption of responsibility for the Customer's vehicle, shall commence only at the point in time when Allbikes and Vespa Warehouse personnel have (i) retrieved the keys from the key drop location, and (ii) physically moved the vehicle into our secure workshop during regular business hours.</p>\n    <p>d. Release of Claims: The Customer hereby releases and holds harmless Allbikes and Vespa Warehouse, its employees, and agents from any and all claims, damages, and losses arising from theft, vandalism, fire, weather-related damage, or any other cause of loss to their motorcycle prior to the formal commencement of bailment as defined in c.</p>\n\n</body>\n</html>",
    "published_at": "2026-01-05T13:49:16.269Z"
  }
}
]
