[
  {
    "model": "inventory.motorcycle",
    "pk": 3,
    "fields": {
      "model": "E110s",
      "year": null,
      "price": "4490.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 0,
      "engine_size": 50,
      "range": null,
      "seats": 2,
      "transmission": "automatic",
      "description": "Make the smart switch to electric with the Segway E110s. This stylish eScooter simplifies your commute with the latest technology, featuring a full-colour LED display and seamless smartphone connectivity. With an extra-long seat for comfort and a stunning design, it's the clean, intelligent, and affordable way to navigate the city.",
      "youtube_link": "https://www.youtube.com/watch?v=pai_QTdKOJw&ab_channel=Segway-NinebotEurope",
      "date_posted": "2025-07-22T16:18:12.429Z",
      "rego": null,
      "rego_exp": null,
      "stock_number": null,
      "warranty_months": null,
      "conditions": [
        1
      ],
      "make": "Segway"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 4,
    "fields": {
      "model": "E125s",
      "year": null,
      "price": "6990.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 0,
      "engine_size": null,
      "range": 140,
      "seats": 2,
      "transmission": "automatic",
      "description": "Experience the pinnacle of electric scooting with the Segway E125s. Engineered for performance and style, it boasts a powerful 3.5 kW motor and an impressive range of up to 140 km, powered by dual removable batteries.\r\n\r\nThe spacious seat comfortably accommodates two riders, with a large storage compartment underneath. Stay connected and secure with full smartphone integration, a brilliant colour LED display, and advanced AHRS anti-theft technology. With a top speed of 45 km/h, it's the ultimate sustainable ride for the modern commuter.",
      "youtube_link": "https://www.youtube.com/watch?v=rGdWLxi2p8k&ab_channel=Segway-NinebotEurope",
      "date_posted": "2025-07-22T16:50:58.570Z",
      "rego": null,
      "rego_exp": null,
      "stock_number": null,
      "warranty_months": null,
      "conditions": [
        1
      ],
      "make": "Segway"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 5,
    "fields": {
      "model": "E300se",
      "year": null,
      "price": "8990.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 0,
      "engine_size": null,
      "range": 130,
      "seats": 2,
      "transmission": "automatic",
      "description": "Unleash a new level of electric performance with the Segway E300se, the brand's first high-speed eScooter engineered for the demanding rider. At its heart is the cutting-edge MoleDrive X600 Controller, delivering five-star performance and thrilling acceleration.\r\n\r\n\r\nWhile built for speed, the E300se doesn't compromise on practicality, offering a massive 34L under-seat storage space. Paired with Segway's signature smart connectivity, this is the ultimate fusion of power, intelligence, and utility.",
      "youtube_link": "https://www.youtube.com/watch?v=xFVF0brHsZ8&ab_channel=Segway-NinebotEurope",
      "date_posted": "2025-07-22T16:52:34.139Z",
      "rego": null,
      "rego_exp": null,
      "stock_number": null,
      "warranty_months": null,
      "conditions": [
        1
      ],
      "make": "Segway"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 6,
    "fields": {
      "model": "Crox",
      "year": null,
      "price": "4490.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 0,
      "engine_size": 50,
      "range": null,
      "seats": 2,
      "transmission": "automatic",
      "description": "Unleash your inner city explorer with the Sym Crox 50. With its aggressive styling, naked handlebars, and a sharp digital dash, this is not your average moped. It’s designed to stand out.\r\n\r\nPowered by a modern and efficient 4-stroke 50cc engine, the Crox delivers responsive, reliable performance. Its combination of 12-inch wheels and a powerful front disc brake ensures confident and agile handling through urban traffic. Weighing just 98 kg with a comfortable 780 mm seat height and a fully automatic transmission, the Crox 50 is incredibly fun and easy to ride.",
      "youtube_link": null,
      "date_posted": "2025-07-22T16:58:53.153Z",
      "rego": null,
      "rego_exp": null,
      "stock_number": null,
      "warranty_months": null,
      "conditions": [
        1
      ],
      "make": "Sym"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 7,
    "fields": {
      "model": "Drgbt 160",
      "year": null,
      "price": "8990.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 0,
      "engine_size": 158,
      "range": null,
      "seats": 2,
      "transmission": "automatic",
      "description": "Meet the Sym DRGBT 160, a cutting-edge, high-performance sports scooter. Its powerful 158cc liquid-cooled, EURO5-compliant engine features an advanced Anti-Lift Engine Hanger system, delivering incredible stability under acceleration. The intelligent design continues with a front-mounted fuel tank for a lower center of gravity, ensuring exceptional balance and maneuverability.\r\n\r\nConfidence in every corner comes from large front and rear disc brakes backed by dual-channel Bosch ABS. The DRGBT is packed with premium technology, including full LED lighting, an elegant digital dash, and a fast-charging USB port. Aggressive styling and an industry-leading 4-year warranty complete the ultimate urban sports package.",
      "youtube_link": null,
      "date_posted": "2025-07-22T17:02:36.264Z",
      "rego": null,
      "rego_exp": null,
      "stock_number": null,
      "warranty_months": 48,
      "conditions": [
        1
      ],
      "make": "Sym"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 8,
    "fields": {
      "model": "Orbit ii 125",
      "year": null,
      "price": "5490.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 0,
      "engine_size": 125,
      "range": null,
      "seats": 2,
      "transmission": "automatic",
      "description": "Discover the Sym Orbit-3 125, the ultimate city commuter designed for easy and efficient urban travel. Its reliable 125cc engine comfortably handles speeds up to 80 km/h, while the simple twist-and-go automatic transmission, 12-inch wheels, and confident front disc brake make navigating busy streets a breeze.\r\n\r\nThe Orbit-3 is packed with practical features for your daily routine. It includes a rear rack ready for a top box, generous under-seat storage with a built-in anti-theft switch, and the peace of mind of having both an electric starter and a backup kick start. It’s the smart, comfortable, and dependable choice for your commute.",
      "youtube_link": null,
      "date_posted": "2025-07-22T17:05:07.186Z",
      "rego": null,
      "rego_exp": null,
      "stock_number": null,
      "warranty_months": 48,
      "conditions": [
        1
      ],
      "make": "Sym"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 9,
    "fields": {
      "model": "Classic 125 sport",
      "year": null,
      "price": "5990.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 0,
      "engine_size": 125,
      "range": null,
      "seats": 2,
      "transmission": "automatic",
      "description": "Don't let the timeless, classic styling fool you—the Sym 125 Classic Sport packs a serious punch. Beneath its elegant exterior lies a powerful EURO5-compliant 125cc engine, equipped with Sym's advanced Anti-lift Engine Hanger System for remarkable stability. Combined with a low center of gravity and adjustable dual rear suspension, it offers a ride that is both thrillingly responsive and exceptionally smooth.\r\n\r\nThis scooter is loaded with premium features. Confident stopping power is assured by front and rear disc brakes with a Combined Braking System (CBS). Modern conveniences include full LED lighting, a digital dash, and a fast-charging USB port. Best of all, it comes standard with a colour-matched top box for ample storage and is backed by an industry-leading 4-year warranty, making it the complete package of style, performance, and peace of mind.",
      "youtube_link": null,
      "date_posted": "2025-07-22T17:07:12.085Z",
      "rego": null,
      "rego_exp": null,
      "stock_number": null,
      "warranty_months": 48,
      "conditions": [
        1
      ],
      "make": "Sym"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 10,
    "fields": {
      "model": "Symphony st200i",
      "year": null,
      "price": "6690.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 0,
      "engine_size": 169,
      "range": null,
      "seats": 2,
      "transmission": "automatic",
      "description": "Engineered for comfort without compromise, the Sym Symphony is the perfect city commuter, especially for taller riders. Its large 16-inch wheels and generous frame design provide ample legroom and superior stability over uneven city streets. Power comes from a punchy yet economical 4-stroke engine, while the Combined Braking System (CBS) on front and rear disc brakes ensures confident stopping power in all conditions.\r\n\r\n\r\nThis scooter is a master of practicality. With generous under-seat storage, a handy front glove box, and a shopping bag hook, you'll have space for everything your day requires. It also comes standard with a rear rack, ready for a top box to further expand its carrying capacity. Backed by an industry-leading 4-year warranty, the Symphony offers an unbeatable combination of comfort, utility, and reliability.",
      "youtube_link": "https://www.youtube.com/watch?v=rdS-cndBpDI&ab_channel=GLOBALSYM",
      "date_posted": "2025-07-22T17:13:21.461Z",
      "rego": null,
      "rego_exp": null,
      "stock_number": null,
      "warranty_months": 48,
      "conditions": [
        1
      ],
      "make": "Sym"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 11,
    "fields": {
      "model": "Joymax z 300",
      "year": null,
      "price": "10490.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 0,
      "engine_size": 278,
      "range": null,
      "seats": 2,
      "transmission": "automatic",
      "description": "Meet the Joymax Z+ 300, the next evolution in maxi-scooter design. Engineered to maximize your riding enjoyment, the Z+ delivers the perfect harmony of agile sports handling and business-class comfort. Its powerful 300cc liquid-cooled engine provides thrilling performance, while the compact, sophisticated chassis ensures nimble control whether navigating city traffic or enjoying a weekend tour.\r\n\r\nThe Joymax Z features a sharp, modern design packed with the latest technology and premium quality finishes. It continues SYM’s tradition of offering exceptional value, blending high performance and advanced features with an affordable price point. For the rider who demands both excitement and relaxation without compromise, the Joymax Z 300 is the intelligent choice.",
      "youtube_link": "https://www.youtube.com/watch?v=qBu8sjaJ77Y&ab_channel=GLOBALSYM",
      "date_posted": "2025-07-22T17:17:47.142Z",
      "rego": null,
      "rego_exp": null,
      "stock_number": null,
      "warranty_months": 48,
      "conditions": [
        1
      ],
      "make": "Sym"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 12,
    "fields": {
      "model": "Max400i",
      "year": null,
      "price": "12490.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 0,
      "engine_size": 399,
      "range": null,
      "seats": null,
      "transmission": "automatic",
      "description": "Experience the pinnacle of maxi-scooter evolution with the Sym Maxsym 400. While retaining its signature elegant style, this new EURO5-compliant generation has been completely re-engineered from within. A new, lighter frame enhances both agility and high-speed stability, delivering a remarkably responsive ride. This sophisticated engineering also results in significantly improved fuel efficiency, perfect for both daily commuting and long-distance touring.\r\n\r\nThe Maxsym 400 is defined by its advanced safety and convenience technology. It comes equipped with a Traction Control System (TCS) for complete confidence and control on any road surface. Modern features such as a Keyless ignition system add seamless convenience to your ride, while the Advanced Brake Light (ABL) enhances your visibility to others in critical situations. This is a true statement of sophistication and technological leadership.",
      "youtube_link": "https://www.youtube.com/watch?v=stbtiAfHAmU&ab_channel=GLOBALSYM",
      "date_posted": "2025-07-22T17:22:07.455Z",
      "rego": null,
      "rego_exp": null,
      "stock_number": null,
      "warranty_months": 48,
      "conditions": [
        1
      ],
      "make": "Sym"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 14,
    "fields": {
      "model": "Px 150",
      "year": 2013,
      "price": "6500.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 7,
      "engine_size": 149,
      "range": null,
      "seats": 2,
      "transmission": "manual",
      "description": "Discover the timeless charm of the 2013 VESPA PX 150, a true embodiment of Italian craftsmanship and classic style. This scooter is not just a mode of transportation; it's an iconic statement on two wheels. With its striking red exterior, this VESPA PX 150 stands out, capturing the attention of everyone who appreciates both form and function.\r\n\r\nIntroducing the 2013 VESPA PX 150, a quintessential icon of style and sophistication that epitomizes the perfect blend of classic design and modern engineering. This immaculate scooter, dressed in a vibrant and eye-catching red, is not just a mode of transportation but a statement of timeless elegance and a tribute to the rich legacy of Vespa.\r\n\r\nThe VESPA PX 150 is the embodiment of Italian craftsmanship, renowned for its distinctive bodywork and vintage appeal. Despite its 2013 model year, it offers a nostalgic journey back to the golden era of scootering while delivering contemporary performance and reliability. With just 7 kilometers on the odometer, this scooter is in excellent condition, promising a near-new riding experience that’s rare to find in a pre-owned vehicle.\r\n\r\nUnderneath its stunning exterior, the PX 150 is powered by a robust, unleaded engine that provides a smooth and responsive ride. The automatic transmission ensures effortless handling, making it an ideal choice for both novice riders and seasoned enthusiasts who appreciate convenience without compromising on the thrill of the ride. Whether you’re navigating busy city streets or enjoying a leisurely cruise, the PX 150 offers unparalleled comfort and agility.\r\n\r\nThe scooter’s design is complemented by its practical features, ensuring that every ride is as enjoyable as it is stylish. Its compact frame allows for easy maneuverability and parking, while the comfortable seating provides ample space for both rider and passenger. The PX 150 is not just about aesthetics; it’s about delivering an experience that’s both functional and pleasurable.\r\n\r\nAs a trusted provider of bike sales and dealership services, we are proud to offer this exquisite VESPA PX 150 to discerning buyers who appreciate quality and heritage. Our commitment to excellence ensures that you receive not only a remarkable vehicle but also exceptional service tailored to your needs. Whether you’re a collector, a commuter, or someone who simply loves the open road, the VESPA PX 150 is more than just a scooter; it’s a lifestyle choice that promises to turn every journey into an adventure.\r\n\r\nDon’t miss the opportunity to own a piece of Vespa history, perfectly preserved and ready to deliver countless smiles per gallon. This stunning red PX 150 is waiting to become your trusted companion on the road, inviting you to embrace the freedom and joy of riding in style.",
      "youtube_link": null,
      "date_posted": "2025-07-30T03:07:46.141Z",
      "rego": "000000",
      "rego_exp": null,
      "stock_number": "394",
      "warranty_months": null,
      "conditions": [
        2
      ],
      "make": "Vespa"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 15,
    "fields": {
      "model": "Fly 150",
      "year": 2011,
      "price": "2650.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 29017,
      "engine_size": 149,
      "range": null,
      "seats": 2,
      "transmission": "automatic",
      "description": "Introducing the 2011 Piaggio Fly 150, a sleek and stylish scooter that combines Italian craftsmanship with practicality and performance. This scooter is the perfect choice for urban commuters and those looking to navigate city streets with ease and efficiency. With its timeless design and reliable engineering, the Piaggio Fly 150 offers a sophisticated and economical solution for your transportation needs.\r\n\r\nThe scooter's body is finished in a pristine white, exuding elegance and modernity that will turn heads wherever you go. Despite being in good condition, this vehicle has been well-maintained and is ready to deliver a seamless riding experience. With an odometer reading of 29,017 kilometers, this Piaggio Fly 150 has demonstrated its durability and continues to promise many more kilometers of adventure.\r\n\r\nEquipped with an automatic transmission, this scooter ensures a smooth and effortless ride, allowing you to focus on the road ahead and enjoy the journey. The Fly 150 runs on unleaded fuel, making it an environmentally friendly option that doesn't compromise on power or performance. Its compact design makes it easy to park and maneuver, perfect for navigating crowded streets and tight spaces.\r\n\r\nBeyond its attractive aesthetics and reliable performance, the Piaggio Fly 150 is designed with rider comfort and safety in mind. The spacious seat provides ample room for both rider and passenger, while the ergonomic handlebars and intuitive controls make for an enjoyable riding experience. The scooter's robust suspension system and responsive brakes offer stability and confidence, even on uneven road surfaces.\r\n\r\nOur dealership is proud to offer this exceptional Piaggio Fly 150 as part of our comprehensive bike sales and dealership services. We are committed to providing you with a seamless purchasing experience, ensuring the scooter meets all your needs and expectations. Our knowledgeable team is here to assist you with any questions you may have and to help you secure the best deal possible.\r\n\r\nWhether you're a seasoned rider or new to the world of scooters, the 2011 Piaggio Fly 150 is an outstanding choice that combines style, practicality, and performance into one impressive package. Don't miss the opportunity to own this remarkable scooter and experience the freedom and convenience it has to offer. Visit us today to take a closer look and discover why the Piaggio Fly 150 is the perfect companion for your urban adventures.",
      "youtube_link": null,
      "date_posted": "2025-07-31T02:26:05.169Z",
      "rego": "000000",
      "rego_exp": "0026-04-06",
      "stock_number": "395",
      "warranty_months": null,
      "conditions": [
        2
      ],
      "make": "Piaggio"
    }
  },
  {
    "model": "inventory.motorcycle",
    "pk": 16,
    "fields": {
      "model": "Ninja 400",
      "year": 2019,
      "price": "5999.00",
      "condition": "",
      "status": "for_sale",
      "odometer": 19771,
      "engine_size": 400,
      "range": null,
      "seats": 2,
      "transmission": "manual",
      "description": "Experience the thrill of the ride with this sleek 2019 Kawasaki Ninja 400. Dressed in a striking black finish, this motorcycle combines style and performance in perfect harmony. Powered by a dynamic engine and featuring a manual transmission, the Ninja 400 offers an exhilarating riding experience for both new and seasoned riders. This well-maintained bike is in good condition, ready to deliver unmatched agility and power on every journey. Visit our dealership today to explore this incredible machine and take advantage of our premier bike sales and dealership services. Ride away with confidence and style on this remarkable Kawasaki Ninja 400.",
      "youtube_link": null,
      "date_posted": "2025-07-31T06:47:03.829Z",
      "rego": "000000",
      "rego_exp": "0005-10-01",
      "stock_number": "243",
      "warranty_months": null,
      "conditions": [
        2
      ],
      "make": "Kawasaki"
    }
  }
]